In [65]:
import pandas as pd #데이터 분석 라이브러리
import numpy as np  # 수치 계산 
# import twisted

In [66]:
print(pd.__version__)

1.3.4

In [67]:
print(np.__version__)

1.20.3

<목차>
1. Object creation
2. Viewing data : head(), index, columns, to_values(), describe()<-- 통계값 , sort_values() <-- 특정 값으로 정렬 
3. Selection
   - Getting
   - Selection by label : loc
   - Selection by position : iloc
   - Boolean indexing : 조건에 맞는 값 가져오기
   - Setting
4. Missing data
5. Operations
   - Stats(통계치)
   - Apply
   - Histogramming
   - String Methods
6. Merge
   - Concat
   - Merge
7. Grouping
8. Reshaping
   - Stack
   - Povot stables
--------------------------
9. Time series
10. Categoricals
11. Plotting
12. Getting data in/out

# 1. Object creation

In [68]:
s = pd.Series([1,3,5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [69]:
dates = pd.date_range('20130101', periods=6)

In [70]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [71]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [72]:
df

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308

In [73]:
df2 = pd.DataFrame({'A':1,
                   'B':pd.Timestamp('20130102'),
                   'C':pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D':np.array([3]*4, dtype='int32'),
                   'E':pd.Categorical(["test", "train", "test", "train"]),
                   'F':'foo'})

In [74]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [75]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), int32(1), int64(1), object(1)
memory usage: 288.0+ bytes

In [76]:
list(range(4))

[0, 1, 2, 3]

In [77]:
np.array([3]*4)

array([3, 3, 3, 3])

In [78]:
pd.Categorical([1, "train", "test", "train"])

[1, 'train', 'test', 'train']
Categories (3, object): [1, 'test', 'train']

In [84]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# 2. Viewing data

In [87]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD')
df.head()

SyntaxError: invalid syntax (Temp/ipykernel_25264/1006129297.py, line 2)

In [86]:
df.tail()

                   A         B         C         D
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308

In [88]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [89]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [90]:
# to_numpy() 대신 (pandas version 0.24.0)
df.values

array([[ 1.7526476 ,  0.0124778 , -0.91511778, -0.47012338],
       [ 1.14236807,  0.32375816,  0.28880167, -1.58239351],
       [-0.74975923, -1.07055989, -1.22332514, -1.221589  ],
       [-2.28939168, -0.43957897,  1.32068447,  0.35925879],
       [-0.86316982, -0.12540899, -1.31768506, -0.9947698 ],
       [-0.92033071, -0.19642186,  0.50230181, -0.46830767]])

In [91]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.752648    1.142368   -0.749759   -2.289392   -0.863170   -0.920331
B    0.012478    0.323758   -1.070560   -0.439579   -0.125409   -0.196422
C   -0.915118    0.288802   -1.223325    1.320684   -1.317685    0.502302
D   -0.470123   -1.582394   -1.221589    0.359259   -0.994770   -0.468308

In [92]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-01  1.752648  0.012478 -0.915118 -0.470123

In [93]:
# 특정 칼럼 기준으로 값 정렬
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394

# 3. Selection

### (1) Getting

Selecting a single column, which yields a Series, equivalent to df.A:

In [94]:
df['A']

2013-01-01    1.752648
2013-01-02    1.142368
2013-01-03   -0.749759
2013-01-04   -2.289392
2013-01-05   -0.863170
2013-01-06   -0.920331
Freq: D, Name: A, dtype: float64

In [95]:
# 행 인덱싱
# Selecting via [], which slices the rows.
df[0:3]

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589

In [96]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259

## (2) Selection by label : loc[]

In [97]:
dates
df

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308

In [98]:
df.loc[dates[0]]

A    1.752648
B    0.012478
C   -0.915118
D   -0.470123
Name: 2013-01-01 00:00:00, dtype: float64

In [99]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  1.752648  0.012478
2013-01-02  1.142368  0.323758
2013-01-03 -0.749759 -1.070560
2013-01-04 -2.289392 -0.439579
2013-01-05 -0.863170 -0.125409
2013-01-06 -0.920331 -0.196422

In [100]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.142368  0.323758
2013-01-03 -0.749759 -1.070560
2013-01-04 -2.289392 -0.439579

In [101]:
df.loc['20130102':'20130104', 'A':'B']

                   A         B
2013-01-02  1.142368  0.323758
2013-01-03 -0.749759 -1.070560
2013-01-04 -2.289392 -0.439579

In [102]:
df.loc['20130102', ['A', 'B']]

A    1.142368
B    0.323758
Name: 2013-01-02 00:00:00, dtype: float64

In [103]:
df.loc[dates[0], 'A']

1.7526476010421863

In [104]:
# (참고) at : loc와 똑같은 방법
df.at[dates[0], 'A']

1.7526476010421863

## (3) Selection by position : iloc[]

In [105]:
df

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308

In [106]:
# 특정 행 값들 가져오기
df.iloc[3]

A   -2.289392
B   -0.439579
C    1.320684
D    0.359259
Name: 2013-01-04 00:00:00, dtype: float64

In [107]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -2.289392 -0.439579
2013-01-05 -0.863170 -0.125409

In [108]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.142368  0.288802
2013-01-03 -0.749759 -1.223325
2013-01-05 -0.863170 -1.317685

In [109]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589

In [110]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  0.012478 -0.915118
2013-01-02  0.323758  0.288802
2013-01-03 -1.070560 -1.223325
2013-01-04 -0.439579  1.320684
2013-01-05 -0.125409 -1.317685
2013-01-06 -0.196422  0.502302

In [111]:
df.iloc[1, 1]

0.32375815996186647

## (4) Boolean indexing(조건에 맞는 값 가져오기)

In [112]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394

In [113]:
df[df > 0]

                   A         B         C         D
2013-01-01  1.752648  0.012478       NaN       NaN
2013-01-02  1.142368  0.323758  0.288802       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN       NaN  1.320684  0.359259
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06       NaN       NaN  0.502302       NaN

In [114]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [115]:
df2

                   A         B         C         D      E
2013-01-01  1.752648  0.012478 -0.915118 -0.470123    one
2013-01-02  1.142368  0.323758  0.288802 -1.582394    one
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589    two
2013-01-04 -2.289392 -0.439579  1.320684  0.359259  three
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770   four
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308  three

In [116]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589   two
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770  four

## (5) Setting

In [117]:
df

                   A         B         C         D
2013-01-01  1.752648  0.012478 -0.915118 -0.470123
2013-01-02  1.142368  0.323758  0.288802 -1.582394
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589
2013-01-04 -2.289392 -0.439579  1.320684  0.359259
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308

In [118]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102', periods=6))

In [119]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [120]:
df['F'] = s1

In [121]:
# loc와 같은 방법
df.at[dates[0], 'A'] = 0

In [122]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.012478 -0.915118 -0.470123  NaN
2013-01-02  1.142368  0.323758  0.288802 -1.582394  1.0
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589  2.0
2013-01-04 -2.289392 -0.439579  1.320684  0.359259  3.0
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770  4.0
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308  5.0

In [123]:
# iloc와 같은 방법
df.iat[0,1]=0

In [124]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -0.915118 -0.470123  NaN
2013-01-02  1.142368  0.323758  0.288802 -1.582394  1.0
2013-01-03 -0.749759 -1.070560 -1.223325 -1.221589  2.0
2013-01-04 -2.289392 -0.439579  1.320684  0.359259  3.0
2013-01-05 -0.863170 -0.125409 -1.317685 -0.994770  4.0
2013-01-06 -0.920331 -0.196422  0.502302 -0.468308  5.0

In [125]:
np.array([5] * len(df))

array([5, 5, 5, 5, 5, 5])

In [126]:
# Setting by assigning with a NumPy array:
df.loc[:, 'D'] = np.array([5] * len(df))

In [127]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.915118  5  NaN
2013-01-02  1.142368  0.323758  0.288802  5  1.0
2013-01-03 -0.749759 -1.070560 -1.223325  5  2.0
2013-01-04 -2.289392 -0.439579  1.320684  5  3.0
2013-01-05 -0.863170 -0.125409 -1.317685  5  4.0
2013-01-06 -0.920331 -0.196422  0.502302  5  5.0

In [128]:
df2 = df.copy()

In [ ]:
# df2의 0보다 큰 값들은 전부 마이너스를 곱해라
df2[df2 > 0] = -df2

In [81]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

# 4. Missing data

pandas primarily uses the value np.nan to represent missing data.  #  값이 없는 데이터 표현 
It is by default not included in computations.

In [130]:
df.columns

Index(['A', 'B', 'C', 'D', 'F'], dtype='object')

In [131]:
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

NameError: name 'df1' is not defined

In [132]:
# nan값이 있는 행들을 모두 삭제   all = 전부 NaN 값이어야 삭제 
# default 값은 any 
df1.dropna(how='any')

NameError: name 'df1' is not defined

In [133]:
# nan값이 있는 자리에 value를 채우기
df1.fillna(value=5)

NameError: name 'df1' is not defined

In [ ]:
# nan값이 있는지 확인하기
pd.isna(df1)

# 5. Operations

## (1) Stats(통계 데이터)

In [134]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.915118  5  NaN NaN
2013-01-02  1.142368  0.323758  0.288802  5  1.0 NaN
2013-01-03 -0.749759 -1.070560 -1.223325  5  2.0 NaN
2013-01-04 -2.289392 -0.439579  1.320684  5  3.0 NaN

In [135]:
df1

                   A         B         C  D    F   E
2013-01-01  0.000000  0.000000 -0.915118  5  NaN NaN
2013-01-02  1.142368  0.323758  0.288802  5  1.0 NaN
2013-01-03 -0.749759 -1.070560 -1.223325  5  2.0 NaN
2013-01-04 -2.289392 -0.439579  1.320684  5  3.0 NaN

Operations in general exclude missing data.
Performing a descriptive statistic:

In [141]:
df1.mean() # df1.mean()과 같다. (0은 행 기준)  값은 열 기준

A   -0.474196
B   -0.296595
C   -0.132239
D    5.000000
F    2.000000
E         NaN
dtype: float64

In [139]:
df1.mean(1)   # (1은 index 기준)

2013-01-01    1.021221
2013-01-02    1.550986
2013-01-03    0.791271
2013-01-04    1.318343
Freq: D, dtype: float64

In [142]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [143]:
# shift는 이동
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(0)
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [ ]:
df

In [144]:
# df의 각 값들에서 s를 뺀다
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01 -1.000000 -1.000000 -1.915118  4.0  NaN
2013-01-02 -1.857632 -2.676242 -2.711198  2.0 -2.0
2013-01-03 -5.749759 -6.070560 -6.223325  0.0 -3.0
2013-01-04       NaN       NaN       NaN  NaN  NaN
2013-01-05 -6.863170 -6.125409 -7.317685 -1.0 -2.0
2013-01-06 -8.920331 -8.196422 -7.497698 -3.0 -3.0

## (2) Apply

In [149]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.915118  5  NaN
2013-01-02  1.142368  0.323758  0.288802  5  1.0
2013-01-03 -0.749759 -1.070560 -1.223325  5  2.0
2013-01-04 -2.289392 -0.439579  1.320684  5  3.0
2013-01-05 -0.863170 -0.125409 -1.317685  5  4.0
2013-01-06 -0.920331 -0.196422  0.502302  5  5.0

In [155]:
# 특정 칼럼 나열
df.apply('A')

2013-01-01    0.000000
2013-01-02    1.142368
2013-01-03   -0.749759
2013-01-04   -2.289392
2013-01-05   -0.863170
2013-01-06   -0.920331
Freq: D, Name: A, dtype: float64

In [154]:
# 각 열마다 최대값-최소값
df.apply(lambda x: x.max() - x.min())

A    3.431760
B    1.394318
C    2.638370
D    0.000000
F    4.000000
dtype: float64

## (3) Histogramming

In [156]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    1
1    2
2    1
3    6
4    2
5    0
6    2
7    2
8    1
9    3
dtype: int32

In [157]:
s.value_counts()

2    4
1    3
6    1
0    1
3    1
dtype: int64

## (4) String Methods

In [ ]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

In [ ]:
s.str.lower()

# 6. Merge

## (1) Concat

In [159]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.977533  0.978382  0.901273  1.557585
1  1.323339  0.019857  0.565907 -1.975961
2  0.410634  0.296413 -1.191228  0.510121
3 -0.394065 -0.192743 -0.829272  0.400866
4  0.834412 -1.055332  2.074997  0.582224
5  0.694955  0.244611 -0.391186  1.769789
6  1.031015  0.291477  1.215637  0.586961
7  0.425087 -0.525306 -1.444124 -0.718608
8 -0.487682  0.708090  0.573373  1.050750
9  0.588557  1.710752 -1.201779 -0.900365

In [160]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.977533  0.978382  0.901273  1.557585
 1  1.323339  0.019857  0.565907 -1.975961
 2  0.410634  0.296413 -1.191228  0.510121,
           0         1         2         3
 3 -0.394065 -0.192743 -0.829272  0.400866
 4  0.834412 -1.055332  2.074997  0.582224
 5  0.694955  0.244611 -0.391186  1.769789
 6  1.031015  0.291477  1.215637  0.586961,
           0         1         2         3
 7  0.425087 -0.525306 -1.444124 -0.718608
 8 -0.487682  0.708090  0.573373  1.050750
 9  0.588557  1.710752 -1.201779 -0.900365]

In [161]:
pd.concat(pieces)

          0         1         2         3
0 -0.977533  0.978382  0.901273  1.557585
1  1.323339  0.019857  0.565907 -1.975961
2  0.410634  0.296413 -1.191228  0.510121
3 -0.394065 -0.192743 -0.829272  0.400866
4  0.834412 -1.055332  2.074997  0.582224
5  0.694955  0.244611 -0.391186  1.769789
6  1.031015  0.291477  1.215637  0.586961
7  0.425087 -0.525306 -1.444124 -0.718608
8 -0.487682  0.708090  0.573373  1.050750
9  0.588557  1.710752 -1.201779 -0.900365

## (2) merge

In [162]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [163]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [164]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [165]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [169]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [170]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# 7. Grouping

## groupby

In [171]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C': np.random.randn(8),
                   'D': np.random.randn(8)}
                 )

In [172]:
df

     A      B         C         D
0  foo    one -0.462405 -0.264291
1  bar    one -0.738591  1.299173
2  foo    two -0.945397 -0.904639
3  bar  three  0.089382 -1.252293
4  foo    two -0.224893 -1.480944
5  bar    two  2.260860 -0.596607
6  foo    one  2.006447  0.372702
7  foo  three  0.457763 -1.297678

In [173]:
df.groupby('A').sum()

            C         D
A
bar  1.611651 -0.549727
foo  0.831515 -3.574850

In [174]:
df.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.738591  1.299173
    three  0.089382 -1.252293
    two    2.260860 -0.596607
foo one    1.544042  0.108411
    three  0.457763 -1.297678
    two   -1.170291 -2.385583

# 8. Reshaping

zip : 파이썬 내장함수
zip() : 동일한 개수로 이루어진 자료형을 묶어 주는 역할을 하는 함수

https://076923.github.io/posts/Python-24/
반복 가능한 객체에 별표(Asterisk, *)를 함께 사용한다면, 언패킹되어 묶여있던 객체들이 나눠지게 됩니다.
즉, 2차원 리스트는 1차원 리스트 만큼 나눠서 반환하게 됩니다.
이 때, 집 함수를 사용하여 다시 패킹한다면 각 원소마다 묶기 때문에 여러 반복문을 구성하지 않아도 다시 패킹 할 수 있습니다.
zip(*n차원 객체)는 zip(n-1차원 객체1, n-1차원 객체2, ...)로 볼 수 있습니다.

In [175]:
# zip 함수 사용법
Number_Name = list(zip([1,2,3,4], ['hong','gil','dong','nim']))
Number_Name

[(1, 'hong'), (2, 'gil'), (3, 'dong'), (4, 'nim')]

## (1) stack

In [176]:
list(zip([['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))

[(['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],),
 (['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two'],)]

In [177]:
# 반복 가능한 객체에 별표(Asterisk, *)를 함께 사용한다면, 
# 언패킹되어 묶여있던 객체들이 나눠지게 됩니다.
list(zip(*[['bar', 'bar', 'baz', 'baz','foo', 'foo', 'qux', 'qux'],
           ['one', 'two', 'one', 'two','one', 'two', 'one', 'two']]))

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [ ]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                     'foo', 'foo', 'qux', 'qux'],
                    ['one', 'two', 'one', 'two',
                     'one', 'two', 'one', 'two']]))
tuples

In [ ]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [ ]:
index

In [ ]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

In [ ]:
df2 = df[:4]

In [ ]:
df2

In [ ]:
# stack()을 하면 데이터를 쌓아서 보여줌
stacked = df2.stack()
stacked

In [ ]:
# unstack()를 하면 원상복귀
stacked.unstack()

In [ ]:
stacked.unstack(1)

In [ ]:
stacked.unstack(0)

## (2) Pivot tables

In [178]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                   'B': ['A', 'B', 'C'] * 4,
                   'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                   'D': np.random.randn(12),
                   'E': np.random.randn(12)})

In [179]:
df

        A  B    C         D         E
0     one  A  foo -2.383976  1.270028
1     one  B  foo -0.002380 -1.208361
2     two  C  foo  2.317867  2.141926
3   three  A  bar -0.298011  0.507341
4     one  B  bar  0.611314 -0.008683
5     one  C  bar -1.928135  0.429343
6     two  A  foo -0.992025  0.644777
7   three  B  foo -1.586609  0.557415
8     one  C  foo -0.436272  0.334373
9     one  A  bar  0.706834 -0.005535
10    two  B  bar -0.976359  1.402437
11  three  C  bar  0.159263  1.116858

In [180]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.706834 -2.383976
      B  0.611314 -0.002380
      C -1.928135 -0.436272
three A -0.298011       NaN
      B       NaN -1.586609
      C  0.159263       NaN
two   A       NaN -0.992025
      B -0.976359       NaN
      C       NaN  2.317867

# 엑셀 다루는 판다스

## 새 column 추가하기 (맨 마지막에 컬럼 추가)

In [182]:
# np.arange().reshape()  arange특정 수 만큼  리스트, reshape(4,4) = 4행 4열로 구성 
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=None,
                  columns=['price', 'qty', 'price', 'qty'])
df

   price  qty  price  qty
0      0    1      2    3
1      4    5      6    7
2      8    9     10   11
3     12   13     14   15

In [183]:
df['name'] = '-'
df

   price  qty  price  qty name
0      0    1      2    3    -
1      4    5      6    7    -
2      8    9     10   11    -
3     12   13     14   15    -

## 원하는 위치에 컬럼 추가하기

In [184]:
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=None,
                  columns=['price', 'qty', 'price', 'qty'])
df

   price  qty  price  qty
0      0    1      2    3
1      4    5      6    7
2      8    9     10   11
3     12   13     14   15

In [188]:
# df.insert(loc, column, value, allow_duplicates=False)
df.insert(2, 'name', '-', allow_duplicates=False )
df

ValueError: cannot insert name, already exists

## 기본 테이블을 멀티 컬럼, 인덱스로 바꾸기

In [ ]:
df1 = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=None,
                  columns=['price', 'qty', 'price', 'qty'])
df1

In [ ]:
import pandas as pd
df2 = pd.DataFrame(df1.values,
                   index = df1.index, 
                   columns = [['apple','apple','banana','banana'], ['price','qty','price','qty']])  
# 2중 칼럼으로 만들기
df2

## (이름으로) 행,열 삭제

In [ ]:
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=None,
                  columns=['price', 'qty', 'price', 'qty'])
df

In [ ]:
# (이름으로) 행,열 삭제
df2 = df.drop(['price'], axis=1) # axis =1 열 기준  0, 행 기준 
df2

In [ ]:
df = df.drop([2], axis=0)
df

## (인덱스로) n번째 행 삭제

In [ ]:
df = pd.DataFrame(np.arange(16).reshape(4,4),
                  index=None,
                  columns=['price', 'qty', 'price', 'qty'])
df

In [ ]:
# (인덱스로) n번째 행 삭제
df2 = df.drop(df.index[0], axis=0)
df2

## 마지막 행에 컬럼 별 합계 삽입

In [ ]:
df = pd.DataFrame(np.arange(6).reshape(2,3),
                  index=None,
                  columns=['price', 'qty', 'like'])
df

In [189]:
# 마지막 행에 컬럼 별 합계 삽입
df.loc['합계'] = [df[df.columns[x]].sum() for x in range(0, len(df.columns))]
df

,price,qty,name,name,price,qty
0,0,1,-,-,2,3
1,4,5,-,-,6,7
2,8,9,-,-,10,11
3,12,13,-,-,14,15
합계,price 24 price 32 dtype: int64,qty 28 qty 36 dtype: int64,name ---- name ---- dtype: object,name ---- name ---- dtype: object,price 24 price 32 dtype: int64,qty 28 qty 36 dtype: int64

## 데이터프레임으로 만들기

## (1) 튜플을 데이터프레임으로

In [ ]:
import pandas as pd

data = [
('p1', 't1', 1, 2),
('p1', 't2', 3, 4),
('p2', 't1', 5, 6),
('p2', 't2', 7, 8),
('p2', 't3', 2, 8)
]

df = pd.DataFrame(data)
df